foam-v2312/run/template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      5;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

DT 0.001;

libs
(
    "libfieldFunctionObjects.so"
    "libUtilityFunctionObjects.so"
);

functions
{
    calc_psi
    {
        libs ( utilityFunctionObjects );
        type coded;
        name calc_psi;
        enabled yes;

        codeExecute
        #{
            const auto& vel =
                mesh().lookupObject<volVectorField>("U");

            label patchID = mesh().boundaryMesh().findPatchID("bottom");

            dimensionedScalar psi
            (
                "psi",
                dimensionSet(0, 2, -1, 1, 0, 0, 0),
                gSum(vel.boundaryField()[patchID].component(1)*mesh().magSf().boundaryField()[patchID])/gSum(mesh().magSf().boundaryField()[patchID])
            );
              
            if (Pstream::myProcNo() == 0)
            {
                std::ofstream out;
                out.precision(8);
                out.open("psi", std::ios::app);
                out <<  mesh().time().timeName() << " " << psi.value() << "\n";
            }
        #};
    }

Tfield
{
    type            scalarTransport;
    libs            ("libsolverFunctionObjects.so");
    writeControl    $writeControl;
    writeInterval   $writeInterval;


    // Optional entries

    // Name of scalar field to transport, default = 's'
    field           T;

    // Name of flux field, default = 'phi'
    phi             phi;

    // Name of density field for compressible cases, default = 'rho'
    rho             rho;

    // Name of phase field to constrain scalar to, default = 'none'
    phase           none;

    // Set the scalar to zero on start/re-start
    resetOnStartUp  no;

    // Name of field to use when looking up schemes from fvSchemes
    // default = <field>
    schemesField    T;


    // Diffusivity

    // Fixed value diffusivity
    D               $DT;

    // Name of field to use as diffusivity, default = 'none'
    nut             none;

    // Run-time selectable sources
    fvOptions
    {
        Tcorrect
        {
            type            scalarCodedSource;
            selectionMode   all;
            fields          ( T );
            name            Tcorrect;

            codeInclude
            #{
                #include "fvCFD.H"
            #};

            codeCorrect
            #{
                Info<< "correcting the solution of T" << endl << "\n";
                //const scalarField& V = mesh().V();
                //const scalar Tb = gSum(T*V)/gSum(V);
                //const scalar Tset = 2;
                //const double frac = Tset/Tb;
                //T = T*frac;
            #};

            codeConstrain
            #{
                Info<< "rescaling Teqn" << endl << "\n";
                const scalarField& V = mesh().V();
                volScalarField T = mesh().lookupObject<volScalarField>("T");
                //const surfaceScalarField& phi = mesh().lookupObject<surfaceScalarField>("phi");
                //const volScalarField& psi = eqn.psi();

                const scalar Tb = gSum(T*V)/gSum(V);

                //Info<< "first Tb:" << gSum(T*V)/gSum(V) << endl;

                const scalar Tset = 2.0;
                const double frac = Tset/Tb;

                Info << "frac:" << frac << endl;
                //Info << eqn.diag() << "and" << eqn.source() << endl;
                eqn.psi() *= frac;
                eqn.source() *= frac;
                //scalarField& diag = eqn.diag();

                //eqn.setValues(cells_, T*frac); //fixedValueConstraint

                //forAll(T, cellI)
                //{
                //    eqn.setValues([cellI], T[cellI]*frac);
                //}
                

                //forAll(T, cellI)
                //{
                //    eqn.source()[cellI] *= frac; // rescaling the eqn
                //}

                //forAll(T, cellI)
                //{
                //    eqn.source()[cellI] += (frac*T[cellI]-T[cellI]); // rescaling the eqn
                //}

                

                //Info<< "second Tb:" << gSum(T*V)/gSum(V) << endl;
                //T.correct();
            #};
            codeAddSup
            #{
                Info << "not adding a Tsource" << endl;
            #};
        }
    }

}

fieldAverage1
{
    // Mandatory entries (unmodifiable)
    type            fieldAverage;
    libs            (fieldFunctionObjects);

    // Mandatory entries (runtime modifiable)
    fields
    (
        U
        {
            mean        yes;
            prime2Mean  yes;
            base        time;
            //windowType   exact;
            //window       10.0;
            //windowName   <name>;
            //allowRestart true;
        }

        T
        {
            mean        yes;
            prime2Mean  yes;
            base        time;
       }
    );

    // Optional entries (runtime modifiable)
    restartOnRestart    false;
    restartOnOutput     false;

    // Optional (inherited) entries
    executeControl  timeStep;
    executeInterval 1;
    writeControl    $writeControl;
    writeInterval   $writeInterval;
}


}


// ************************************************************************* //
