foam-v2312/run/template/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        constants
        {
            width 1;
            nu 1e-2;
            Gr 14.2857;
        }
        
        expression
        #{
            vector((((round(pos().y()) % 2)*2)-1)*10, ((-1*(pow(pos().x()/$[(scalar)constants.width],2)/2)+(2+1)*((pos().x())/6)) * $[(scalar)constants.Gr] * $[(scalar)constants.nu]) ,0)
            //(((round(pos().y()) % 2)*2)-1)*10
        #};
    }
);


// ************************************************************************* //
